<?php
/**
 * Created by PhpStorm.
 * Email:jwy226@qq.com
 * User: LazyBench
 * Date: 2021/3/30
 * Time: 11:23
 */

namespace LazyBench\TaxMultiProxy\App\Yqd\Http;


class Code
{
    public const code = [
        0 => 'success',
        1000 => '通用异常',
        4000 => '信息验证有误',
        4001 => '无效的商户号',
        4002 => '并发太高了，休息一下',
        4003 => '提现的用户不存在请核对参数[uid]',
        4004 => '用户已存在请勿重复添加',
        4005 => '添加用户失败',
        4006 => '无效的用户',
        4007 => '发放任务创建失败',
        4008 => '发放任务明细重复',
        4009 => '无效的发放任务',
        4010 => '您暂无提现权限,请联系管理员确认',
        4011 => '无效的开票记录',
        4012 => '无效的发放明细',
        4013 => '无效的提现订单号',
        4014 => '无效的用户',
        4015 => '错误的手机号格式',
        4016 => '无效的参数',
        4017 => '实名认证未通过',
        4018 => '只有待确认的任务可以进行此操作',
        4019 => '账户余额不足',
        4020 => '低于最小限额50',
        4021 => '超过最大限额98000',
        4022 => '验签失败',
        4023 => '开票金额大于可开票金额',
        4024 => '用户身份证号码错误',
        4025 => '用户银行卡预留姓名错误',
        4026 => '备注错误',
        5000 => '系统异常',
    ];
}